
/*
 TPOSApiClient.m
 */
"unknown_error"="Unknown Error";
"unknown_data_type"="Unknown Data Type";

/*
 TPOSGuideViewController.m
 */
"self_controlled"="self-controlled";
"p2p_trans"="p2p transfer";
"dapps_browser"="DApps Browser";
"easy_trade"="easy to exchange";
"welcome_2"="Welcome to New World";
"enter_tp"="Enter Token Pocket";

/*
 TPOSTabBarController.m
 */
"Assets"="Assets";
"Markets"="Markets";
"Discover"="Discover";
"Profile"="Profile";
"Exchanges"="Exchanges";

/*
 TPOSCustomMJRefreshFooter.m
 */
"reach_bottom"="Oops, on bottom";
"slide_load_more"="Slide up";
"loading_more"="Loading more...";

/*
 TPOSCameraUtils.m
 */
"warm_tip"="Tips";
"camera_setting_tips"="Allow Camera Usage at [Settings - TokenPocket - Camera]";
"confirm"="Confirm";
"album_access_failed"="Cannot access album for system reasons";
"no_camera"="Cannot detect the camera";

/*
 NSDate+TPOS.m
 */
"just_now"="just now";
"one_min_ago"="minute ago";
"n_min_ago"="minutes ago";
"one_h_ago"="hour ago";
"n_h_ago"="hours ago";
"one_day_ago"="day ago";
"n_day_ago"="days ago";
"one_m_ago"="month ago";
"n_m_ago"="months ago";
"one_y_ago"="year ago";
"n_y_ago"="years ago";

"trans_record"="Transaction Records";
"trans_succ"="Transaction Successed";
"trans_fail"="Transaction Failed";
"transing"="Transaction Processing";
"copy_to_board"="Copied to Pasteboard";
"trans_query"="Transaction Query";
"trans_detail"="Transaction Detail";

"transaction"="Transaction";
"has_error"="Go wrong";
"package_fail"="Package failed";
"packaging"="Processing";
"trans_suc"="Transaction Successed";
"trans_fai"="Transaction Failed";
"choose_token"="Choose Tokens";
"missing_wallet_addr"="Missing a wallet address";
"missing_trans_amount"="Missing transfer amount";
"trans_to_self"="Don't transfer to yourself";
"wrong_addr_tips"="Wrong address, please examine";
"no_enough_token"="No sufficient currencies";
"next_step"="Next";
"token_trans"="Token Transfer";
"choose_token"="Choose Tokens";
"wallet_addr"="Wallet Addresses";
"input_paste_addr"="Input or Paste addresses";

"trans_amount"="Transfer Amount";
"input_out_amount"="Input transfer amount";
"miner_fee"="fee";
"select_fee"="Select miners' fee";
"comment"="comment";
"trans_num"="TX#";
"blc_num"="Block Height";
"trans_time"="TimeStamp";
"copy_url"="Copy URL";
"choose_token_trans"="Choose Transfer Tokens";

"req_exchange_list_fail"="Request List Failed";

"add_new_tokens"="Add New Tokens";
"wrong_and_try_later"="Oops, try later.";
"all"="All";


"receive"="Receipt";
"receiver"="Receiver";
"copied"="Copied";
"copy_wallet_addr"="Copy";
"rece_amount"="Receipt Amount";
"set_rec_amount"="Set Receive Amount";

"cannot_recog_qrcode"="Cannot recognize the QR Code";
"align_qrcode"="Align QR Code within frame to scan";
"album"="Album";
"scan"="Scan";

"input_asset_name"="Input asset's name";
"cancel"="Cancel";
"confirm"="Confirm";
"hot_coin"="Hot Tokens";
"coming_soon"="Coming soon";

"add_tokens"="Add Tokens";
"support_token_tip"="Supporting Blockchain Assets like SWTC etc.";
"all_wallet"="All Wallets";
"no_wallet_tips"="No wallets, Create one.";
"ok"="OK";

"how_to"="How-to";
"advanced"="Advanced";

"custom_gas_price"="Custom Gas Price";
"custom_gas"="Custom Gas";

/*
 TPOSTransactionConfirmView.m
 */
"input_pwd"="Input Password";
"confirm"="Confirm";

/*
 TPOSAssetHeader.m
 */
"my_asset"="My Assets";

/*
 TPOSAssetPopWindow.m
 */
"create_wallet"="Create Wallets";

/*
 TPOSSearchTokenCell.m
 */
"added"="Added";
"add"="Add";

/*
 TPOSAssetCreateWalletView.m
 */
"all_wallet"="All Wallets";
"has_no"="No ";
"title_wallet"=" Wallet";
"wallet"="Wallet";
"s_wallet"="'s wallet";
"s_only_token_chain"="'s tokens can only be stored in its own chain type.";

/*
 TPOSDiscoveryViewController.m
 */
"dapp_recomd"="Dapps Recommendation";
"hot_articles"="Hots & Articles";

/*
 TPOSExchangeWalletVewController.m
 */
"switch_account"="Switch Account";

/*
 TPOSMineViewController.m
 */
"personal_center"="Personal Center";
"msg"="Message";
"contact"="Contact";
"help"="Help";
"about"="About";
"settings"="Settings";
"point_settings"="PointSetting";
"version"="Version";
"copyright_info"="Copyright";

/*
 TPOSEditWalletViewController.m
 */
"saving"="saving";
"save_succ"="Saved Successfully";
"save_fail"="Saved Fail";
"save"="Save";
"delete_caution"="Caution! This operation cannot be revoked!";
"delete_succ"="Deleted Successfully";
"delete_fail"="Deleted Fail";
"pwd_error"="Password Error";
"pwd_not_match"="Password doesn't match";

/*
 TPOSSettingViewController.m
 */
"login_pwd"="Password Login";
"login_faceid"="FaceID";
"login_touchid"="TouchID";
"language"="Language";
"currency_unit"="Currency Unit";
"web3_setting"="Web3 Setting";
"set"="Set";
"cancel"="Cancel";

/*
 TPOSMessageCenterViewController.m
 */
"read_all"="Read All";

/*
 TPOSMemonicImportWalletViewController.m
 */
"custom_path"="Your Custom Path";
"service_privacy"="Terms of Service and Privacy Policy";
"pwd_not_match"="Password doesn't match, please try again";
"importing"="Importing...";
"m_new_wallet"="M-Wallet";
"import_succ"="Import Successfully";
"import_fail"="Import Failed";
"input_mnemonic_words"="Please use space to separate the mnemonic words";

/*
 TPOSPrivateKeyImportWalletViewController.m
 */
"term_service"="Term of Service";
"wallet_exist"="Wallet Existed";
"pk_wallet"="PK-Wallet";

/*
 TPOSChooseTokenSystemViewController.m
 */
"choose_blc_type"="Choose Blockchain Foundation";
"created"="Already Created";
"blc_type_wallet"="Blockchain's Wallet";

/*
 TPOSImportWalletViewController.m
 */
"import_wallet"="Import Wallet";
"mnemonic"="Mnemonic";
"pri_key"="Private Key";
"keystore_import"="Keystore File";

/*
 TPOSCreateMemonicViewController.m
 */
"backup_mnem"="Backup Mnemonic";
"backup_mnem_tips"="These mnemonic words are for recovering your wallet, write down correctly on paper and keep in a safe place.";

/*
 TPOSConfirmMemonicViewController.m
 */
"confirm_result"="Confirm Result";
"reconfirm_mnemonic"="Confirm failed, please examine your mnemonic words.";
"backup_succ"="Backup Successfully";

/*
 TPOSCreateWalletViewController.m
 */
"choose_wallet_chain_type"="Choose Blockchain Foudation";
"complete_info"="Please complete info";
"at_least_8"="At least 8 characters";
"pwd_not_match"="Password doesn't match";
"read_and_agree"="Read and Agree on Term of Service and Privacy Policy";
"tips"="Tips";
"create_succ"="Create Wallet Successfully";
"create_fail"="Create Wallet Failed";

/*
 TPOSBackupWalletViewController.m
 */
"backup_wallet"="Backup Wallets";

/*
 TPOSSelectChainTypeViewController.m
 */
"choose_blc_type"="Blockchain Foundation";
"chain_info_retry"="Oops, Please Slide Down";
"already_wallet"="Cannot import, you already have";
"illegal_mnem"="Illegal mnemonic, please check";

/*
 TPOSWalletManagerViewController.m
 */
"wallet_manage"="Manage Wallet";
"total_asset"="Assets Overview";

/*
 TPOSAboutUsViewController.m
 */
"pri_policy"="Privacy Policy";
"ver_release"="Version Release";
"check_update"="Check for updates";
"app_guide"="App Guide";

/*
 TPOSEditPasswordViewController.m
 */
"modify_succ"="Modified successfully";
"change_pwd"="Change Password";
"done"="Done";

/*
 TPOSMessageCenterCell.m
 */
"receiver"="receiver";
"trans_succ"="Transfer Successfully";
"trans_noti"="Transfer Notification";
"sender"="sender";

/*
 TPOSChooseTokenSystemCell.m
 */
"blc_type"="Blockchain Foundation";

/*
 TPOSPasswordView.m
 */
"weak"="Weak";
"normal"="Normal";
"good"="Good";
"safe"="Safe";

/*
 TPOSAboutUsCell.m
 */
"curr_version"="Current Version:";

/*
 TPOSWalletChainCell.m
 */
"created"="existed";

/*
 TPOSTransactionRecoderCell.m
 */
"processing"="Processing";

/*
 TPOSMarketEditViewController.m
 */
"all_select"="Select All";
"unselect"="Unselect All";
"delete_fail_retry"="Delete Failed, Please Retry.";
"delete"="Delete";

/*
 TPOSMarketViewController.m
 */
"no_token_go_add"="You have no tokens, go and add some.";

/*
 TPOSMarketSearchViewController.m
 */
"search_token_market"="Search Token Tendency";
"add_fail"="Add Failed";
"hot_rec"="Hot Recommandations";

/*
 TPOSJTManager.m
 */
"missing_param"="Missing Parameters";
"sign_failed"="local sign failed";

/*
 TPOSAuthPasswordViewController.m
 */
"set_pwd"="Password";
"repeat_pwd"="Repeat Password";
"input_pwd_auth"="Repeat Password to Authorization";
"contact_us"="Oops, contact us!";
"wrong_pwd"="Wrong, try again";
"no_deviceId"="Sorry, your device don't support TouchID/FaceID";
"deviceId_wrong"="TouchID/FaceID authentication failed";
"auth_fail_to_pwd"="TouchID/FaceID locked, input your password.";
"setting_succ"="Setting successfully";

/*
 TPOSForceCreateWalletViewController.m
 */
"usr_agreement"="User Agreement";

/*
 TPOSEnterAuthViewController.m
 */
"auth_pwd"="Auth with Password";
"touch_pwd"="Wake up Password";
"touch_touchId"="Wake up TouchID";
"touch_faceId"="Wake up FaceID";

/*
 AppDelegate.m
 */
"update_tips"="Token Pocket Updated, Enjoy it.";
"go_download"="Go to download";

/*
 JHPieChart.m
 */
"amount"="Amount";
"rate"="Rate";

/*
 TPOSAuthID.m
 */
"input_pwd"="Password";
"auth_with_touchId"="Authenticate TouchID Through Home Button";

/*
 TPOSTransactionEmptyView
 */
"soon"="Coming Soon";
"de_exchange"="Decentralized Global Digital Assets Exchanges";

/*
 TPOSMarketHeader.h
 */
"now_price"="Price";
"change_ratio"="Change";
"no_market_tendency"="Oops, no market tendency";
"add_tendency"="Add Tendencies";

"pay_wallet"="From";
"trans_out"="To";
"trans_info"="TX Info";
"trans_detail"="Transaction Detail";
"confirm_trans"="Confirm Transaction";

"fee_setting"="Fee Setting";
"gas_slow"="Slow";
"gas_fast"="Fast";
"gas_rec"="recommand";

"wallet_delete"="Delete Wallet";
"wallet_name"="Name";
"wallet_addr"="Address";
"change_pwd"="Reset Password";
"export_pk"="Export PK";
"export_keystore"="Export Keystore";
"addr_copy"="Copy";

"pwd_curr"="Old One";
"pwd_new"="Reset";
"pwd_repeat"="Repeat";
"pwd_forget"="Forget it? You can recover from ";
"import_imid"="Importing";

"pla_pwd_curr"="Your Old Password";
"pla_pwd_new"="Your New Password";
"pla_pwd_repeat"="Repeat Password";

"total_asset_title"="Total Assets";
"title_share_to"="Share To";
"title_button_cancel"="Cancel";
"wx_frnds"="Friends";
"wx_timeline"="Timeline";
"share_qq"="QQ";

"tip_one"="Password strength is critical to guard your wallet.";
"tip_two"="We can't recover the password, please backup cautiously.";

"wallet_foundation"="Foundation";
"wallet_name"="Wallet Name";
"set_pwd"="Password";
"repeat_pwd"="Repeat";
"pwd_hint"="Password Hint";
"pwd_optional"="optional";
"read_agree"="Read & agreed on";
"input_private_key"="Please input your private key";
"derive_path"="Path";
"import_start"="Start Importing";

"pwd_length_tip"="At least 8 characters, better to mix letters, digits, symbols.";
"pwd_length_weak"="Password is too weak, easily get hacked.";

"mnemonic_write_down"="Please backup the mnemonic words";
"confirm_mnemonic_title"="Confirm your mnemonic words";
"confirm_mnemonic_desc"="Please choose mnemonic words in order and make sure your mnemonic was correct written";
"entry_agree"="Agree with Terms of Service and Privacy Policy to Enter";
"tap_reauth"="Retry";

"send_trans_fail"="Unable to Make a Transaction";
"desc_wrong_pwd"="Wrong Password";

"backup_wallet_line_prefix"="For your wallet (";
"backup_wallet_line_suffix"=")'s safety";
"backup_tips"="Please backup the mnemonic or the private key";
"backup_now"="Backup now";

"read_first"="Read the Policies First";
"about_us_desc"="Doughnut is a Safe, Simple and Powerful digital assets light wallet. We aim to make Blockchain happen to average users.";

/*
 TPOSKeystoreImportWalletViewController.m
 */

"keystore_hint" = "Copy and paste the contents of the wallet Keystore file into the input box, or scan the QRcode.";
"keystore_placeholder" = "Please enter Keystore file";
